SET NAMES utf8;
DROP DATABASE IF EXISTS top;
CREATE DATABASE top CHARSET=UTF8;
USE top;
/*bighot*/
CREATE TABLE bighot_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64),
  url VARCHAR(64),
  ucontent VARCHAR(100),
  utitle VARCHAR(64),
  pic VARCHAR(64),
  show_index INT
);
INSERT INTO bighot_item VALUES
(NULL,'仙剑奇侠传幻璃镜','','入镜成妖，破界重生！年度期待手游，上软重生之作《仙剑奇侠传幻璃镜》于今日开启全平台公测！游戏延续承自仙剑奇侠传的经典神、魔、仙、妖、鬼、人六界架构，以“生存”为主题，采用多线剧...','入镜成妖破界重生《仙剑幻璃镜》公测','img/index/4288950e-1d44-4398-9b85-e41d7e8d9037.jpg',1),
(NULL,'弹弹堂手游','','腾讯首款多人对战弹射游戏《弹弹堂手游》于4月25日安卓、iOS 双平台同时正式开启不删档测试。作为腾讯游戏和第七大道联合打造的倾情之作，将为用户带来极致弹射乐趣。','《弹弹堂》不删档 尽享多人对弹乐趣','img/index/562e7219-d762-4021-8aaf-5e8345fdc7c1.jpg',3),
(NULL,'龙之谷手游','','《龙之谷手游》新版本带来最具挑战的“绿龙巢穴”副本，再度点燃玩家PVE激情！此外，地狱犬、狮蝎、天启巢穴也新增了星级挑战玩法，前往挑战即可获得炫酷驱魔师套。','绿龙侵袭 《龙之谷手游》全新版本上线','img/index/8e318e77-be64-4886-9f83-2a7abb7fcf17.jpg',4),
(NULL,'凡人修仙传','','由起点白金作家忘语正版授权，3D飞仙空战手游《凡人修仙传》4月11日11:00全平台正式上线。游戏将原著中令人神往的修仙世界真切展现在众道友面前。在游戏中...','《凡人修仙传》4月11日首发版本前瞻','img/index/11e3558b-5049-470e-8e5e-80559627d608.jpg',2);
/*newbighot_item*/
CREATE TABLE newbighot_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uhead VARCHAR(64),
  url VARCHAR(64),
  ucontent VARCHAR(100),
  utitle VARCHAR(64),
  pic VARCHAR(64),
  show_index INT
);
INSERT INTO newbighot_item VALUES
(NULL,'三大派齐出镜 《射雕英雄传手游》5月18日迎...','','由青春“靖蓉”组合杨旭文、李一桐代言，完美世界，万达院线游戏联合发行，金庸及同名电视剧正版授权的《射雕英雄传手游》5月18日迎来第二轮安卓删档测试。','三大派齐出镜 《射雕英雄传手游》5月18日迎二测','img/index/8c997ccd-75bd-4f8e-bbc8-fe3b3f524a72.jpg',4),
(NULL,'入镜成妖破界重生《仙剑幻璃镜》5.8全平台...','','入镜成妖，破界重生！年度期待手游，上软重生之作《仙剑奇侠传幻璃镜》开启全平台公测！游戏延续承自仙剑奇侠传的经典神、魔、仙、妖、鬼、人六界架构..','入镜成妖破界重生《仙剑幻璃镜》5.8全平台公测','img/index/067b6d0b-b36b-499f-a9ff-ed9102d39dec.jpg',2),
(NULL,'正版敢达授权手游 《敢达争锋对决》今日首...','','正版敢达动作对战手游《敢达争锋对决》今日10：00开启首测。从已曝光的资料来看，这款全新的高达手游，可谓诚意满满，这次测试喜欢高达的粉丝一定不能错过。','正版敢达授权手游 《敢达争锋对决》今日首测','img/index/78ba53e8-004c-4f39-ae93-4cfb84aa7654.jpg',1),
(NULL,'迪丽热巴代言魔幻巨作《神话永恒》5月4日上...','','炫酷魔幻巅峰巨作《神话永恒》5月4日10点全平台震撼上线！征服绝世性感女神，体验全服之王霸权，感受次世代端游画质，畅享神秘魔幻大世界！','迪丽热巴代言魔幻巨作《神话永恒》5月4日上线','img/index/14695a41-6d29-4b36-af7a-4ee4f224ba2b.jpg',3);
/*test*/
CREATE TABLE test_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  url VARCHAR(64),
  ucontent VARCHAR(100),
  pic VARCHAR(64),
  score DOUBLE(10,2)
);
INSERT INTO test_item VALUES
(NULL,' ','《龙之谷》评测：还原高 它还需要更多“手游化”的新内容','img/index/97fa2fc1-2844-4327-bc98-b49a6179455f.jpg',8.7),
(NULL,' ','《刀剑兵器谱》评测：自由格斗 真实江湖','img/index/f921f416-fa0a-4f88-877e-9a00163d8a7e.jpg',7.6),
(NULL,' ','《数码宝贝tri》评测：告别卡牌 玩的停不下来','img/index/4cbf0f1f-ad80-4a22-a028-9ebcdd92ee5b.jpg',7.2),
(NULL,' ','《幻影纹章》评测：战棋粉和火纹迷首选','img/index/6539d80e-bb46-451e-ad66-6358fa4eb1b9.jpg',8.5),
(NULL,' ','《北凉悍刀行》评测：无规则束缚 更自由游戏','img/index/6ae93602-2413-4a37-95e7-ba13f09868b7.jpg',8.0),
(NULL,' ','《最终幻想:觉醒》评测：继承零式之特征 独自创出新的幻想','img/index/ed40c3ea-b597-4146-a641-a8bcb99d625e.jpg',8.2),
(NULL,' ','《大圣之怒》评测：西游之后，大圣棒打诸天神魔','img/index/f1a700af-aca9-4fb3-b2a8-f63cc022de81.jpg',7.6),
(NULL,' ','《闪电突袭》评测：指挥官成为新版本最大赢家','img/index/27048ad0-1d12-4e1d-a66c-cf476f38efb0.jpg',7.9),
(NULL,' ','《SD敢达强袭战线》评测：动作手游诚意之作','img/index/be568891-6729-4b42-b1f9-b472e2434080.jpg',8.0),
(NULL,' ','《修仙吧少年》评测：没有体力！告别无脑刷刷刷','img/index/cabdf0ea-b47d-42ff-aca3-381bdc987821.jpg',7.3),
(NULL,' ','《冰与火战歌》评测：剧情取胜 代入感超强','img/index/e8a5d716-603d-4dbe-a5b6-8e58b09f8bef.jpg',7.1),
(NULL,' ','《少女咖啡枪》评测：萌系枪战 细致入微的诚意','img/index/edc2b283-b817-4e95-badb-bd3d6e817a0f.jpg',8.4);
/*billboard*/
CREATE TABLE billboard_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uhead VARCHAR(64),
  url VARCHAR(64),
  utitle VARCHAR(64),
  pic VARCHAR(64),
  score VARCHAR(64),
  star INT
);
INSERT INTO billboard_item VALUES
(NULL,'阴阳师',' ','立即下载','img/index/16945015.png','评分4',4),
(NULL,'诛仙',' ','立即下载','img/index/com.wanmei.zhuxian.ewan.sky-592f71b5b6fb8.png','评分4',4),
(NULL,'问道',' ','立即下载','img/index/com.gbits.atmdj.itools.sky-570c5a7325bfb.jpg','评分4',4),
(NULL,'保卫萝卜3',' ','立即下载','img/index/com.tencent.tmgp.carrot3-58101f015cc74.png','评分4',4),
(NULL,'皇室战争',' ','立即下载','img/index/com.supercell.clashroyale.itools.sky-56fcd75ceb2bc.jpg','评分4',4),
(NULL,'梦幻西游',' ','立即下载','img/index/com.netease.my.ewan.sky-5934c13fc18f5.png','评分3',3),
(NULL,'王者荣耀',' ','立即下载','img/index/com.tencent.tmgp.sgame-591d0c2d352aa.jpg','评分3',3),
(NULL,'大话西游',' ','立即下载','img/index/com.netease.dhxy.ewan.sky-590310ed5f372.jpg','评分3',3),
(NULL,'剑侠世界',' ','立即下载','img/index/13937824.png','评分3',3),
(NULL,'穿越火线',' ','立即下载','img/index/com.tencent.tmgp.cf-591d0cc79eac6.png','评分2',2);
/*forum*/
CREATE TABLE forum_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  url VARCHAR(64),
  utitle VARCHAR(64),
  ucontent VARCHAR(64),
  pic VARCHAR(64),
  ucount VARCHAR(64)
);
INSERT INTO forum_item VALUES
(NULL,' ','苍穹变','第一人气小说PK手游','img/index/11705-175.jpg','话题：26'),
(NULL,' ','花千骨','人气仙侠小说同名游戏','img/index/11364-175.jpg','话题：11'),
(NULL,' ','三国吧兄弟','高B格动作卡牌手游巨制','img/index/11381-175.jpg','话题：25'),
(NULL,' ','刀塔传奇','刀塔传奇粉丝的专属聚集地','img/index/10152-175.jpg','话题：377'),
(NULL,' ','超神战记','划时代养成竞技手游','img/index/11407-175.jpg','话题：3'),
(NULL,' ','拳皇97OL','掀起移动端格斗盛宴','img/index/11218-175.jpg','话题：152'),
(NULL,' ','暗黑黎明','暗黑手游S级大作','img/index/10505-175.jpg','话题：109'),
(NULL,' ','时空猎人','开创指尖竞技的全新领域','img/index/10172-175.jpg','话题：61');
/*周边*/
CREATE TABLE relatedproduct_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64),
  url VARCHAR(64),
  pic VARCHAR(100),
  uprice VARCHAR(64),
  xprice VARCHAR(64)
);
INSERT INTO relatedproduct_item VALUES
(NULL,'大辅V仔兽手办','','img/digimon/TB2AjmDs90mpuFjSZPiXXbssVXa_!!14054390.jpg_400x400.jpg',"60.00","40.00"),
(NULL,'数码宝贝手表','','img/digimon/TB2QSCVipXXXXaFXXXXXXXXXXXX_!!644852261.jpg_430x430q90.jpg',"108.50","79.00"),
(NULL,'数码宝贝项链','','img/digimon/TB2sC4_dW9I.eBjy0FeXXXqwFXa_!!2082375282.jpg_430x430q90.jpg',"128.00","99.00"),
(NULL,'太一亚古兽手办','','img/digimon/TB2sJHRtXXXXXciXXXXXXXXXXXX_!!14054390.jpg_400x400.jpg',"60.00","40.00"),
(NULL,'昆卡Q版手办','','img/DOTA2/TB2_HACXNaK.eBjSZFBXXagMXXa_!!1898943986.jpg_430x430q90.jpg',"50.80","29.90"),
(NULL,'风行者手办','','img/DOTA2/TB2gz._tFXXXXaoXpXXXXXXXXXX_!!207918145.jpg_400x400.jpg',"450.00","399.00"),
(NULL,'蝴蝶武器挂件','','img/DOTA2/TB2zEmmXV15V1Bjy1XdXXayCFXa_!!1700337826.jpg_400x400.jpg',"19.50","9.90"),
(NULL,'莉娜Q版手办','','img/DOTA2/TB2_HACXNaK.eBjSZFBXXagMXXa_!!1898943986.jpg_430x430q90.jpg',"50.80","29.90"),
(NULL,'阿轲Q版手办','','img/wzry/TB2iRh4tSVmpuFjSZFFXXcZApXa_!!1898943986.jpg_430x430q90.jpg',"80.00","29.90"),
(NULL,'张飞水晶挂件','','img/wzry/TB2btLybC1I.eBjy0FjXXabfXXa_!!409167967.jpg_400x400.jpg',"15.00","14.00"),
(NULL,'李元芳马克杯','','img/wzry/TB2WNlcbB0kpuFjy1XaXXaFkVXa_!!1657376236.jpg_400x400.jpg',"35.00","17.50"),
(NULL,'诸葛亮Q版手办','','img/wzry/TB2lGLyqq8lpuFjy0FpXXaGrpXa_!!1898943986.jpg_430x430q90.jpg',"80.00","29.90"),
(NULL,'晴明Q版手办','','img/yys/TB2E387oNBmpuFjSZFDXXXD8pXa_!!771003778.jpg_400x400.jpg',"88.00","68.00"),
(NULL,'神乐等身抱枕','','img/yys/TB2htBYlrBnpuFjSZFGXXX51pXa_!!273360730.jpg_400x400.jpg',"92.60","72.20"),
(NULL,'大天狗香囊','','img/yys/TB2T4lHpstnpuFjSZFvXXbcTpXa_!!675230936.jpg_400x400.jpg',"24.00","19.00"),
(NULL,'神乐Q版手办','','img/yys/TB2hgPNgSJjpuFjy0FdXXXmoFXa_!!771003778.jpg_400x400.jpg',"88.00","68.00");
/*会员*/
CREATE TABLE user_item(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64),
  upwd VARCHAR(64)
);
INSERT INTO user_item VALUES
(NULL,'mary','123456'),
(NULL,'jack','123456');

/*游戏类型*/
CREATE TABLE gametype(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64)
);
INSERT INTO gametype VALUES
(NULL,'全部'),
(NULL,'单机'),
(NULL,'网游');
/*游戏平台*/
CREATE TABLE gameterrace(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64)
);
INSERT INTO gameterrace VALUES
(NULL,'全部'),
(NULL,'苹果'),
(NULL,'安卓');
/*游戏玩法*/
CREATE TABLE gameplay(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64)
);
INSERT INTO gameplay VALUES
(NULL,'全部'),
(NULL,'角色扮演'),
(NULL,'动作'),
(NULL,'策略'),
(NULL,'模拟'),
(NULL,'益智'),
(NULL,'卡牌'),
(NULL,'体育'),
(NULL,'竞速'),
(NULL,'音乐'),
(NULL,'消除'),
(NULL,'射击'),
(NULL,'休闲'),
(NULL,'其他');
/*游戏题材*/
CREATE TABLE gamesubject(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64)
);
INSERT INTO gamesubject VALUES
(NULL,'全部'),
(NULL,'养成'),
(NULL,'仙侠'),
(NULL,'塔防'),
(NULL,'西游'),
(NULL,'三国'),
(NULL,'动漫'),
(NULL,'横版'),
(NULL,'武侠'),
(NULL,'恶搞'),
(NULL,'战争'),
(NULL,'其他');
/*游戏*/
CREATE TABLE game(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(64),
  pic VARCHAR(100),
  utype VARCHAR(64),
  ugametype VARCHAR(100),
  ugameterrace VARCHAR(100),
  ugameplay VARCHAR(100),
  ugamesubject VARCHAR(100),
  usize VARCHAR(64),
  score DOUBLE(10,2),
  content VARCHAR(200)
);
INSERT INTO game VALUES
(NULL,'王者荣耀','img/hotgame/wzry.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作策略','全部三国','424.1MB',4.1,'《王者荣耀》是全球首款5V5英雄公平对战手游，腾讯最新MOBA手游大作！ 作为一款MOBA类游戏，《王者荣耀》特色多多，在同类的游戏中可谓是一枝独秀，艳压全场。'),
(NULL,'阴阳师','img/hotgame/yys.png','网络游戏','全部网游','全部苹果安卓','全部卡牌休闲','全部养成动漫','632.97MB',4.3,'《阴阳师》手游是网易游戏在2016年自主研发的一款3D唯美和风手游，以日本家喻户晓的阴阳师IP为背景，沿用经典人设，讲述了人鬼共生的平安时代，阴阳师安倍晴明探寻自身记忆的故事。剧情充实细腻而不乏创新点，画风唯美空灵极具和风意境，是网易2016年的战略产品。'),
(NULL,'保卫萝卜3','img/hotgame/bwlb3.jpg','网络游戏','全部网游','全部苹果安卓','全部策略休闲','全部其他','170MB',4.4,'《保卫萝卜3》是《保卫萝卜》官方正统新作。游戏的主要背景定位到了城市中，并加入了创新性的剧情模式、全新炮塔、全新地图、全新玩法，让玩家在建设炮塔保卫主人公“阿波”的同时感受到塔防游戏的别样乐趣。'),
(NULL,'皇室战争','img/hotgame/hjzz.jpg','网络游戏','全部网游','全部苹果安卓','全部益智策略休闲','全部塔防','94MB',3.3,'Supercell旗下最近作品，游戏以《部落冲突》的世界观，创造了一种全新的集合MOBA、塔防、集换式卡牌等多种元素的策略卡牌玩法。'),
(NULL,'龙之谷','img/hotgame/lzg.jpg','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作休闲','全部其他','633MB',4.2,'《龙之谷》手游是一款由腾讯运营，以盛大端游《龙之谷》为故事背景制作的3DARPG手游。游戏原汁原味复刻了端游的剧情、世界观，带你重回记忆中的阿尔特里亚，重现最激爽的3D无锁定战斗。'),
(NULL,'花千骨','img/hotgame/hqg.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演休闲','全部仙侠','443.88MB',4.7,'《花千骨》手游是根据暑期档热播电视剧《花千骨》及其小说原著改编而成的正版授权3D动作手游。'),
(NULL,'银时之魂','img/hotgame/yszh.png','网络游戏','全部网游','全部安卓','全部角色扮演恶搞','全部动漫','296.41MB',4.5,'《银时之魂》是以有笑有泪，温暖人心为故事特色的漫画《银魂》改编的正版RPG游戏。这款游戏忠实地再现了银魂的世界观，让玩家充分享受打斗的乐趣！千变万化的伙伴羁绊，可指尖操作的追击组合、热血且爽快的战斗掌握在你手中！'),
(NULL,'弹弹堂手游','img/hotgame/ddt.jpg','网络游戏','全部网游','全部苹果安卓','全部角色扮演射击休闲','全部横版','285MB',4.9,'《弹弹堂手游》核心玩法为趣味性极高的弹道抛射对战，通过不同道具的战术搭配，根据抛物线原理发射炮弹来命中对手或破坏地形，最终击败对手，取得胜利。'),
(NULL,'火柴人联盟','img/hotgame/hcrlm.png','单机游戏','全部单机','全部苹果安卓','全部动作休闲','全部横版','140MB',4.5,'AppStore付费榜第一的格斗游戏！火柴人联盟吹响集结号角，召唤热门游戏七大经典角色：劫、盖伦、寒冰、流浪、剑圣、小丑、铁拳...任意选择两名火柴人英雄，一起并肩作战，体验前所未有的必杀能量！一触即发，开启专属你的炫技之旅吧！KO！'),
(NULL,'割绳子2','img/hotgame/dsz2.png','单机游戏','全部单机','全部苹果安卓','全部益智休闲','全部其他','113MB',4.2,'经典益智大作再续新冒险：一路上与新结识的7位各具神通的爆萌小伙伴展开合作，帮助小吃货完成各种刺激挑战！寻找四叶草，开启隐藏关，完成任务拿奖牌、为小吃货精心打扮！一起开动脑筋，圆满Om Nom的糖果梦吧！'),
(NULL,'最终幻想','img/hotgame/zzhx.png','网络游戏','全部网游','全部安卓','全部角色扮演模拟','全部其他','388MB',4.1,'最终幻想：觉醒是一款充满了魔法味道的MMORPG手游，游戏采用了精致逼真的3D画面打造出一幅惟妙惟肖的生动场景，给玩家带来一场视觉上的饕餮盛宴。'),
(NULL,'数码宝贝tri','img/hotgame/smbb.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部动漫','265.78MB',3.9,'100%完美还原，圆你儿时数码梦！风靡全球的超人气动漫数码宝贝经典重现！亚古兽、加布兽童年伙伴陪你一起成长，一起战斗，共同踏上成就数码大师之路。现在你已被召唤，快点加入数码世界大冒险的旅途吧！'),
(NULL,'三国杀','img/hotgame/sgs.png','网络游戏','全部网游','全部苹果安卓','全部策略卡牌','全部三国','174.67MB',4.7,'《三国杀》是广受华人喜爱的、集历史、美术、卡牌、策略等元素于一身的原创经典“杀人”游戏！游戏中，您将扮演一位三国名将，结合“主、忠、反、内”等身份，相互配合“杀”死对手获得胜利！'),
(NULL,'海岛农场','img/hotgame/hdnc.png','网络游戏','全部网游','全部苹果','全部模拟','全部养成','47MB',4.3,'全新海岛风情农场，专属海岛任你摆布!史上最全装扮材料，百变布局色彩由你!再多财富也需要放松下来过上一段轻松的田园生活。来吧！海岛农场就是你最好的选择！各式各样的农作物，你想种什么就有什么！活泼可爱的宠物们随时等你收养！'),
(NULL,'众神OL','img/hotgame/zsOL.jpg','网络游戏','全部网游','全部苹果','全部角色扮演','全部其他','122.61MB',4.1,'《众神OL》是一款重度MMORPG即时制魔幻史诗网游大作!它融合了东、西方及北欧神话,展现出一个人类文明在邪神的肆意奴役和摧残下，岌岌可危却又处处充满希望的世界!'),
(NULL,'四川麻将','img/hotgame/scmj.png','单机游戏','全部单机','全部苹果安卓','全部模拟','全部益智','88MB',4.3,'采用四川地区流行的麻将规则，特色玩法如：定缺、刮风下雨、血战到底等。游戏融入了养成和竞技场多元化玩法，角色升级、装备强化、升星、寻宝等，玩家可以培养自己喜爱的角色，提升战斗力参加比赛，与其他玩家同台竞技争夺各种比赛奖励。'),
(NULL,'全民突击','img/hotgame/qmtj.png','网络游戏','全部网络','全部苹果','全部射击','全部战争','138MB',4.3,'《全民突击》是腾讯首款FPS枪战手游。 全3D绚丽画面，打造电影级视觉盛宴； 经典名枪、炫酷战车，构建军迷博物馆；  真人实时激烈对战，不再一个人寂寞打枪！ 快加入《全民突击》与6亿玩家共同开启枪战梦想，激爽 战斗吧！'),
(NULL,'北凉悍刀行','img/hotgame/bldhx.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作','全部武侠','240MB',3.1,'以知名小说雪中悍刀行为故事背景，集角色换装、即时战斗、野外地图、江湖历练、国战等为一体的MMORPG手游。玩家是一名身世神秘的少年/少女，因为家人的失踪而踏入江湖，进而接触到庙堂，在江湖中争霸的同时，也会为了国家荣誉而对敌国开战。'),
(NULL,'中超风云','img/hotgame/zcfy.png','网络游戏','全部网游','全部苹果安卓','全部体育','全部养成','168.49MB',4.4,'《中超风云》是由中超公司官方正版授权，由胡莱游戏发行，在体育之窗文化产业有限公司监制下，拱顶石游戏历时两年打造的全新3D国民足球手游。'),
(NULL,'斗破苍穹','img/hotgame/dpcq.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部仙侠','112.23MB',4.1,'《斗破苍穹》手游是由天蚕土豆正版授权的动态卡牌手游，如今蛰伏六载，诚意出品。游戏在玩法上高度还原了小说中的内容，主要角色全部登场，玩家可在游戏中与九位女主角邂逅相遇，体验小说中最刺激的剧情片段。'),
(NULL,'冰与火战歌','img/hotgame/byhzg.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作','全部其他','214.47MB',3.7,'《冰与火战歌》是一款西方魔幻题材的3D MMOARPG，偏写实欧美画风，和氛围感极强的场景设计，为玩家带来前所未有的视觉体验。极具打击感的技能动作，华丽的装备特效，传统MMO端游式的野外交互，让玩家体验到手机上真正的MMOARPG。'),
(NULL,'穿越火线','img/hotgame/cyhx.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演射击','全部战争','505MB',4.3,'《穿越火线：枪战王者》是一款由韩国Smilegate研发商及腾讯游戏三年的倾力打造的CF正版FPS手游，完美传承了PC端的品质和玩法，同时还针对手机端的操作特点，进行了针对枪战玩家习惯的定制化适配与优化，让玩家能够在手机上真正享受枪战游戏带来的乐趣和快感。'),
(NULL,'天天爱消除','img/hotgame/ttaxc.png','单机游戏','全部单机','全部安卓','全部消除','全部其他','70.88MB',3.5,'《天天爱消除》是由腾讯旗下天美工作室群开发的一款消除类手机游戏，《天天爱消除》将超萌的小宠物作为游戏主角，当玩家在移动或消除图像、乃至轻轻触摸到它们时，小动物们都会做出各种各样的表情；在消除游戏上方一个boss之后会得到相应的奖励或道具。'),
(NULL,'刀剑兵器谱','img/hotgame/djbqp.jpg','网络游戏','全部网游','全部安卓','全部角色扮演动作','全部武侠','202.2MB',2.1,'刀剑原班人马打造，国风群侠格斗手游。真·刀剑，百般兵器，刀光剑影生死勿论；真·武侠，群侠并起，万千情缘快意恩仇。'),
(NULL,'剑魂之刃','img/hotgame/jhzr.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作','全部其他','130MB',4.5,'手势格斗！一剑破魂！全球首款手势格斗手游《剑魂之刃》2.0 版“剑魔觉醒”震撼登场！开放首个可变身职业——剑魔！'),
(NULL,'大圣之怒','img/hotgame/dszn.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部西游','429MB',3.6,'《大圣之怒》是由天拓游戏自主研发的3D全自由西游后传国战动作手游，精致唯美的3D画面，殿堂级原声配乐，缔造震撼视听盛宴；野外自由激战，怒气无双连招，尽享畅快战斗体验；一怒扫四方，热血战八荒，美人相伴万人国战；地府时装，齐天大圣，新手即赠丰厚福利。'),
(NULL,'恋舞OL','img/hotgame/lwOL.jpg','网络游戏','全部网游','全部苹果安卓','全部音乐','全部其他','19.7MB',4.5,'《恋舞OL》“闪耀明星”崭露头角，震撼登场！爆棚人气，收获忠实粉丝，荣登秀场头条！温馨照片墙，秀出甜蜜印证，见证模范夫妻！全新闪亮饰品，丰富的综艺通告，一起成就明星梦想《恋舞OL》“闪耀明星”即将诞生，喜欢 玩在一起！'),
(NULL,'天龙八部','img/hotgame/tlbb.png','网络游戏','全部网络','全部苹果安卓','全部角色扮演动作','全部武侠','1.02G',3.7,'《天龙八部》手游是一款全新3DMMO武侠手游，由“天龙八部”端游原班人马精心打造、腾讯代理的精品手游大作，既完美传承了端游核心特色和经典玩法，又有更多手游创新特色玩法；'),
(NULL,'TOM猫跑酷','img/hotgame/TOM.png','单机游戏','全部单机','全部苹果安卓','全部竞速','全部其他','174MB',3.3,'你被打劫啦！探索无穷无尽的跑酷世界，让会说话的汤姆或会说话的安吉拉追强盗，夺回你的金子！不断发现新场景，体验不同跑酷风格，跑酷途中拾取加速器。'),
(NULL,'凡人修仙传','img/hotgame/frxxz.gif','网络游戏','全部网游','全部安卓','全部角色扮演','全部仙侠','89MB',4.4,'《凡人修仙传》至尊版带着亦幻亦真的中国画风强势回归。威武霸气的金狮坐骑，古灵精怪的超萌宠物，变幻莫测的万灵法宝；美煞旁人的修仙情缘，丝丝柔情伴你左右；群仙聚会的修身仙境，挑战修仙最美传说。'),
(NULL,'倩女幽魂','img/hotgame/qnyh.jpg','网络游戏','全部网游','全部苹果安卓','全部角色','全部仙侠','675.26MB',4.2,'唯美古风，国民玄幻！网易第一玄幻网游《新倩女幽魂》原班人马倾力打造，是一款拥有端游级唯美画风与人设，传承经典玩法，并开创百人团战，极品装备公平掉落，面对面自由交易等多项创新的即时制MMORPG手游。'),
(NULL,'幻影纹章','img/hotgame/hywz.jpg','网络游戏','全部网游','全部安卓','全部策略模拟','全部其他','260MB',4.1,'日系超人气战棋手游「幻影纹章」，全新战略模拟RPG狂潮即将袭卷而来。日本特效动画大师「押井守」亲自监制。'),
(NULL,'剑侠世界','img/hotgame/jxsj.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作','全部武侠','723.51MB',4.2,'《剑侠世界》手游师承20年经典“剑侠情缘”系列，是西山居金牌团队倾力打造的超S级3D MMOARPG手游。《剑侠世界》手游带来堪比端游的光影表现，其中运用了物理光照、高光法线技术和多种自研引擎插件，实现了法线级角色和场景精度，游戏画面华丽的不像手机游戏。'),
(NULL,'SD敢达强袭','img/hotgame/SDgd.png','网络游戏','全部网游','全部苹果安卓','全部策略动作','全部其他','339MB',4.3,'《SD敢达强袭战线》是由万代株式会社与久游网强强联合打造发行的一款正版授权敢达题材动作手游。历代敢达机体都网罗其中并进行了100%还原再现，更有全系列知名机师加盟助战。'),
(NULL,'闪电突袭','img/hotgame/sdtx.png','网络游戏','全部网游','全部苹果安卓','全部策略','全部战争','186MB',2.5,'《闪电突袭》搜罗众多经典坦克，罗列众多传奇军神，沙盘式即时战斗表现，邀玩家化身陆战灵魂人物，重写二战进程。铁与血化作指尖狂歌，砥砺PK，你的雄韬伟略在此一蹴而就。'),
(NULL,'大富翁9','img/hotgame/dfw9.jpg','网络游戏','全部网游','全部苹果安卓','全部模拟恶搞','全部其他','598MB',4.4,'《大富翁9》是大富翁系列首款联网手游，由网易与大宇联合开发，简体版由网易独家代理发行。你将在《大富翁9》中扮演耳熟能详的孙小美、沙隆巴斯、钱夫人、阿土伯等经典角色。通过每一局人机对战与真人比拼，在环游世界过程中，开启富翁生涯，走上人生巅峰。'),
(NULL,'射雕英雄传','img/hotgame/sdyxz.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演动作','全部武侠','602MB',4.1,'《射雕英雄传手游》是一款移动平台大型多人实时在线网络游戏，以金庸武侠名著《射雕英雄传》为背景，以体现中国武侠风为目的，运用出色的美术创意、创新的自主引擎、构建一个真实而恢弘的武侠江湖。'),
(NULL,'自由之战','img/hotgame/zyzz.png','网络游戏','全部网游','全部苹果安卓','全部动作','全部其他','337MB',4.3,'《自由之战》是一款颠覆传统MOBA类操作体验的即时对战手游！拥有双轮盘加锁定操控，还原经典MOBA体验，百款原创英雄，真实PVP对战，专属王者的竞技手游！'),
(NULL,'神话永恒','img/hotgame/shyh.jpg','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部其他','295MB',3.3,'《神话永恒》是由《全民奇迹》原班团队倾力打造的一款新生代魔幻MMORPG手游，该游戏由曾负责过《天堂2》《剑灵》《TERA》的韩国资深美术设计师进行艺术监制，延续了炫酷华丽的韩系幻想画面风格。'),
(NULL,'我是篮板王','img/hotgame/wslbw.png','网络游戏','全部网游','全部苹果','全部体育卡牌','全部动漫','136.7MB',4.1,'《我是篮板王》是根据经典动漫改编的一款卡牌类手机游戏，该作品严格遵循原创动漫的故事线路，将玩家带入热血的球场之中，一起快意拼杀。高度还原的角色形象、新颖的作战模式、精致的画面、炫酷的PK技能无一不让玩家欲罢不能!'),
(NULL,'少女咖啡枪','img/hotgame/snkfq.png','网络游戏','全部网游','全部苹果安卓','全部射击','全部横版','486.75MB',5.0,'《少女咖啡枪》是一款3D少女射击ARPG游戏。末日来临、异怪侵蚀，世界等你拯救！带上你的青梅竹马，带上酷炫霸气的枪械，砰砰砰，瞄准射击！冒险途中有温性格各异的萌妹一起加入旅程，傲娇、三无、御姐、病娇等属性应有尽有。'),
(NULL,'城市飞车','img/hotgame/csfc.png','单机游戏','全部单机','全部安卓','全部竞速','全部其他','40MB',4.2,'《城市飞车》是一款小巧精致的赛车竞速游戏。最佳城市赛车游戏再创传奇！全球最新物理引擎，3D画质带来更刺激的驾驶体验，更完美的视觉感受，尽情地狂奔和破坏吧！'),
(NULL,'仙剑奇侠传','img/hotgame/xjqxz.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部仙侠','1.32G',5.0,'《仙剑奇侠传：幻璃镜》是由软星科技（上海）有限公司开发、百度游戏代理发行的一款仙剑衍生手机游戏，主题为“生存”。该作基于《仙剑奇侠传四》的世界观设定，并回到神、魔、仙、妖、鬼、人的仙剑六界架构，同时战斗操作由回合制改为即时制。'),
(NULL,'口袋妖怪','img/hotgame/kdyg.png','网络游戏','全部网游','全部安卓','全部角色扮演','全部动漫养成','105MB',4.5,'首款国民级3D宠物对战手游《口袋妖怪》百分百的还原了经典动漫，宠物抓捕、培养和进化，图鉴收集、挑战切磋、激烈竞技场争夺精灵联盟冠军，此外还添加了全新的宠物装备，精灵修炼等丰富的特色玩法，让大家在回味经典的同时，又能感受更多的游戏乐趣。'),
(NULL,'心动K歌','img/hotgame/xdkg.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部仙侠','80MB',4.4,'天天爱唱歌是款K歌实时在线网游，是专为移动端量身定制的音乐休闲游戏。游戏采用了最新的3D核心技术，拥有精美的场景、俏皮可爱的角色的造型以及炫酷堪比端游的特效。'),
(NULL,'修仙吧少年','img/hotgame/xxbsn.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部仙侠','262MB',4.2,'《修仙吧少年》是一款集策略、冒险、收集、养成多种玩法与一身的S.rpg游戏。以古中国神话小说《封神演义》为背景故事，玩家可以扮演姜子牙、哪吒、二郎神等传说英雄施展法宝神通，征战四方破阵杀敌。'),
(NULL,'疯狂消星星','img/hotgame/fkxxx.png','单机游戏','全部单机','全部苹果','全部消除','全部其他','3.81MB',2.5,'疯狂消星星是一款简单好玩的休闲游戏,玩法虽然简单,要想得高分还需动动脑子,没有时间限制,有充足的时间考虑哦.'),
(NULL,'三剑豪','img/hotgame/sjh.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部武侠','337.19MB',4.7,'16年最纯粹武侠，林心如惊艳代言。100个原创侠客！打造卷轴式武林群侠传； 600页原创剧情！一本厚过新心动江湖由你书写； 1000+技能组合！4的5次方技能搭配，玩法无穷，最爽战斗体验。'),
(NULL,'新神曲','img/hotgame/xsq.png','网络游戏','全部网游','全部苹果安卓','全部角色扮演','全部仙侠','250MB',4.5,'《新神曲》是一款角色扮演类的手机魔幻网游巨作，游戏保留了神曲页游最经典的玩法与系统，同时增加了很多手游经典操作玩法。游戏主要围绕城池发展、副本探索为主线而展开，作为城主的玩家通过发展城池、招募军队与魔族进行抗衡。');